OpenDTEF-v1912/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoilingIATE/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication $(getApplication)

if notTest $@
then
    foamDictionary system/controlDict -entry endTime -set 5
    foamDictionary 2/T.liquid -entry boundaryField/wall2/q -set 'uniform 1e5'
    runApplication -a $(getApplication)
fi

#------------------------------------------------------------------------------
